KC5-BP/C8051F020-WS2812B/refFiles/mx_manip/ws2812_mx_manip.c
/*..-----------------------------------------------------------------------------------.
../ .---------------------------------------------------------------------------------. \
./´/
|x| __--""'\
|x|  ,__  -'""`;
|x| /   \  /"'  \
|x|   __// \-"-_/
|x| ´"   \  |           > Title : ws2812_mx_manip
|x| \     |  \  _.-"',
|x| "^,-´\/\  '" ,--. \         > Src : ws2812_matrix.c
|x|  \|\| | | , /    | |            >   (first version of the actual header)
|x|     '`'\|._ |   / /
|x|         '\),/  / |          > Creation : 2019.11.21 (Initial creation date)
|x|           |/.-"_/           > By :  KC5-BP
|x| .__---+-_/'|--"
|x|         _| |_--,            > Description :
|x|        ',/ |   /                Declarations of RGB's ws2812b LEDs usage funct. .
|x|        /|| |  /                 as a matrix purpose.
|x|     |\| |/ |- |
|x| .-,-/ | /  '/-"
|x| -\|/-/\/ ^,'|
|x| _-     |  |/
|x|  .  --"  /
|x| /--__,.-/
.\`\__________________________________________________________________________________/´/
..`____________________________________________________________________________________´
========================================================================================>
=======================================================================================*/
// Linker to : ..
// .. definition folder SFR (Like Port Definition "P5", "P6", "TR0", etc...)
#include <c8051f020.h> // <= Would delete it ...
// .. created header for ws2812b led usage.
#include "../led_manip/ws2812_led_manip.h"  // For the << pixel >> struct.
// .. created header for ws2812b matrix usage.
#include "ws2812_mx_manip.h"
// .. character's definitions.
//#include "kc5_bp_matrix_alphanum.h"
// .. character's BIG definitions (Letter's height : X14).
//#include "kc5_bp_matrix_alpha_big.h"

//-- GLOBAL VARIABLES INIT : ----------------------------->
xdata offsetText Offset = {0, 0};                   // Init. column + line to 0.
xdata matrixFormat matrixDisplay = {0, 0};      // Init. matrixView + txtFont to 0.

//-------------------------------------------------------------------------------------->
/*	Initial : 0/+-360 degrees :
 *          33 :  / - - - - - - - -  -  -  -  -  -  -  /
 * 			32 :  \ - - - - - - - -  -  -  -  -  -  -  \.
 * 			 1 :  - - - - - - - - -  -  -  -  -  -  -  /
 * Starting LED-> 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
 * Rotated : 90/-270 degrees :
 *       |   |   |   |   |   |   |   |   |   |  |  |  |  |  | | : 3
 *       |   |   |   |   |   |   |   |   |   |  |  |  |  |  | | : 2
 *       |   \   /   \   /   \   /   \   /   \  /  \  /  \  / | : 1
 *      256 225 224 193 192 161 160 129 128 97 96 65 64 33 32 1  <- Starting LED.
 * Rotated : 180/-180 degrees :
 *       \   -   -   -   -   -   -   -   -   -   -   -   -   -   -   \ : 224
 * 		/   -   -   -   -   -   -   -   -   -   -   -   -   -   -   / : 225
 * 		\   -   -   -   -   -   -   -   -   -   -   -   -   -   -   - : 256
 *      241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256
 * Rotated : 270/-90 degrees :
 *       |  |  |  |  |  |  |   |   |   |   |   |   |   |   |   | : 243
 *       |  |  |  |  |  |  |   |   |   |   |   |   |   |   |   | : 242
 *       \  /  \  /  \  /  \   /   \   /   \   /   \   /   \   / : 241
 *      16 17 48 49 80 81 112 113 144 145 176 177 208 209 240 241                      */
unsigned int pixel_RecoverPosition(unsigned char posX, unsigned char posY)
{	// Var. Dec. :
    xdata unsigned char ui8_newX = 0, ui8_newY = 0;
    xdata posType ui16_returnPos = 0;

    // Condition about starting from 1, instead of 0.
    if (posX == 0)  posX = 1;
    if (posY == 0)  posY = 1;

    switch(matrixDisplay.matrixView)
    {
        case 0:
        case 360:
        case (-360):
            if( !(posY % 2) )   // Even lines on the matrix physical view.
                ui16_returnPos = (posX / (MAX_COLU + 1)) * MAX_LEDS + \
                                                (MAX_COLU - (posX % (MAX_COLU + 1))) \
                                                                + (posY - 1) * MAX_COLU;
            else
                ui16_returnPos = (posX / (MAX_COLU + 1)) * MAX_LEDS + \
                                                    ((posX % (MAX_COLU + 1)) - 1) \
                                                                + (posY - 1) * MAX_COLU;
            break;


        case 90:
        case (-270):
            if( !(posX % 2) )   // Even columns on the matrix physical view.
                ui16_returnPos = (MAX_LEDS - posX * MAX_LINE) + (posY - 1);
            else
                ui16_returnPos = (MAX_LEDS - posY) - (posX - 1) * MAX_LINE;
            break;

        case 180:
        case (-180):
            if((posY % 2) == 0) // Even reverted lines on the matrix physical view.
                ui16_returnPos = MAX_LEDS - posX - (posY - 1) * MAX_COLU;
            else
                ui16_returnPos = MAX_LEDS - (MAX_COLU - (posX - 1)) - (posY - 1) * MAX_COLU;
            break;


        case 270:
        case (-90):
            // Condition about the Line being Even or not.
            // Then, by the Matrix routing, define how the WS281x must be adressed.
            if((posX % 2) == 0)
            {
                ui8_newY = (MAX_LINE - 1) - posY;
            }
            else
            {
                ui8_newY = posY;
            }
            ui16_returnPos = (((posX - 1) * MAX_COLU) + ui8_newY); // Checker les PosRecov en rotation.
            break;

        /* State of every undefined case, so not supposed to come here. */
        default :   break;
    }
    return ui16_returnPos; // Return Pos.
}

//-------------------------------------------------------------------------------------->
#ifdef __kc5_bp_matrix_alphanum__
void matrix_SetTextPosition(unsigned char  column, unsigned char line)
{   // COLUMN validity ..
    //if(column < 1) Offset.column = 1;
    //if(column > MAX_COLU) Offset.column = MAX_COLU;
    //else Offset.column = column;
    // LINE validity ..
    //if(line < 1) Offset.line = 1;
    //if(line > MAX_COLU) Offset.line = MAX_LINE;
    //else Offset.line = line;

    // Need to find a way for getting
    Offset.column = column;
    Offset.line = line;
}

